In [ ]:
#GROUP 6
#JSON AND AZURE WORK DONE IN KAGGLE NOTEBOOK SUBMITTED

In [1]:
# Install required libraries
!pip install pymssql sqlalchemy

import pandas as pd
from sqlalchemy import create_engine

# Azure SQL Database credentials
username = 'xiaoxue-zhang'
password = 'group12345!'
host = 'xiaoxueproject.database.windows.net'
database = 'badm554_project'

# Connection string for SQLAlchemy with pymssql
connection_string = f"mssql+pymssql://{username}:{password}@{host}:1433/{database}"

# Create an SQLAlchemy engine
engine = create_engine(connection_string)

# Test the connection and fetch data (if needed)
try:
    with engine.connect() as connection:
        print("Connection to Azure SQL Database successful!")

        # Example: Query a table in your database
        # Replace 'your_table_name' with the actual table name
        query = "SELECT TOP 10 * FROM your_table_name"
        df = pd.read_sql(query, connection)
        print(df)
except Exception as e:
    print(f"Connection failed: {e}")

Collecting pymssql
  Downloading pymssql-2.3.1-cp310-cp310-manylinux_2_28_x86_64.whl.metadata (7.1 kB)
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.10/dist-packages (2.0.36)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy) (3.1.1)
Downloading pymssql-2.3.1-cp310-cp310-manylinux_2_28_x86_64.whl (4.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 4.6/4.6 MB 19.2 MB/s eta 0:00:00
Installing collected packages: pymssql
Successfully installed pymssql-2.3.1
Connection failed: (pymssql.exceptions.OperationalError) (40615, b"Cannot open server 'xiaoxueproject' requested by the login. Client with IP address '34.23.238.154' is not allowed to access the server.  To enable access, use the Azure Management Portal or run sp_set_firewall_rule on the master database to create a firewall rule for this IP address or address range.  It may take up to five minutes for this change to take effect.DB-Lib error message 20018, severity 14:\nGeneral SQL Server error: Check messages from the SQL Server\nDB-Lib error message 20002, severity 9:\nAdaptive Server connection failed (xiaoxueproject.database.windows.net)\nDB-Lib error message 20002, severity 9:\nAdaptive Server connection failed (xiaoxueproject.database.windows.net)\n")
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [2]:
!curl ifconfig.me

34.23.238.154

In [3]:
pip install ipython-sql

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (3.11.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (2.0.36)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.5.1)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (75.1.0)
Collecting jedi>=0.16 (from ipython->ipython-sql)
  Downloading jedi-0.19.1-py2.py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.48)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Downloading jedi-0.19.1-py2.py3-none-any.whl (1.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 20.5 MB/s eta 0:00:00
Installing collected packages: jedi
Successfully installed jedi-0.19.1

In [4]:
%load_ext sql

In [5]:
# Set the DATABASE_URL environment variable
import os

username = 'xiaoxue-zhang'
password = 'group12345!'
host = 'xiaoxueproject.database.windows.net'
database = 'badm554_project'

os.environ["DATABASE_URL"] = f"mssql+pymssql://{username}:{password}@{host}:1433/{database}"

In [60]:
#SQL QUERY 1
%%sql
SELECT TOP 10 CITY, COUNT(*) AS city_count
FROM business_df
GROUP BY CITY
ORDER BY city_count DESC;

#This query helped us identify the city of our choice ie Lutz

 * mssql+pymssql://xiaoxue-zhang:***@xiaoxueproject.database.windows.net:1433/badm554_project
Done.

[('Philadelphia', 14577),
 ('Tucson', 9262),
 ('Tampa', 9069),
 ('Indianapolis', 7545),
 ('Nashville', 6981),
 ('New Orleans', 6216),
 ('Reno', 5940),
 ('Edmonton', 5056),
 ('Saint Louis', 4832),
 ('Santa Barbara', 3836)]

In [61]:
## SQL QUERY 2
%%sql
SELECT TOP 10 b.name, COUNT(r.business_id) AS review_count
FROM business_df b
JOIN review_df r ON b.business_id = r.business_id
WHERE b.city = 'Lutz' AND b.categories LIKE '%Restaurant%'
GROUP BY b.name
ORDER BY review_count DESC;
#This query helps us identify the famous resturants in the city Lutz

 * mssql+pymssql://xiaoxue-zhang:***@xiaoxueproject.database.windows.net:1433/badm554_project
Done.

[("Ford's Garage", 533),
 ("Chuy's", 467),
 ('Nabruzzi Trattoria', 416),
 ("Little Italy's Family Restaurant & Catering", 363),
 ('Umami Sushi', 323),
 ("BJ's Restaurant & Brewhouse", 318),
 ("Cheddar's Scratch Kitchen", 303),
 ("Walk-On's Sports Bistreaux - Wesley Chapel Restaurant", 284),
 ('Brunchies - Lutz', 280),
 ('Bangkok Sushi', 275)]

In [63]:
#SQL QUERY 3
%%sql
SELECT TOP 10 b.name, COUNT(r.business_id) AS review_count, b.categories
FROM business_df b
JOIN review_df r ON b.business_id = r.business_id
WHERE b.city = 'Lutz' AND b.categories LIKE '%Restaurant%'
GROUP BY b.name, b.categories
ORDER BY review_count DESC;

#This query helps us identify the famous restaurant types in the city of Lutz.
#We identified that the best restaurant type is Fast food restaurant as it has the most review counts

 * mssql+pymssql://xiaoxue-zhang:***@xiaoxueproject.database.windows.net:1433/badm554_project
Done.

[("Ford's Garage", 533, 'Burgers, Bars, Restaurants, Desserts, Comfort Food, Food, Nightlife, Cocktail Bars, American (Traditional), Breakfast & Brunch'),
 ("Chuy's", 467, 'Mexican, Bars, Nightlife, Restaurants, Tex-Mex'),
 ('Nabruzzi Trattoria', 416, 'Restaurants, Event Planning & Services, Bars, Caterers, Venues & Event Spaces, Italian, Pizza, Wine Bars, Nightlife'),
 ("Little Italy's Family Restaurant & Catering", 363, 'American (New), Seafood, Event Planning & Services, Caterers, Italian, Restaurants, American (Traditional), Pizza'),
 ('Umami Sushi', 323, 'Asian Fusion, Japanese, Restaurants, Chinese, Salad, Soup, Thai, Sushi Bars'),
 ("BJ's Restaurant & Brewhouse", 318, 'Food, American (New), Restaurants, Pizza, Breweries'),
 ("Cheddar's Scratch Kitchen", 303, 'American (Traditional), Restaurants, Comfort Food, Southern'),
 ("Walk-On's Sports Bistreaux - Wesley Chapel Restaurant", 284, 'American (Traditional), Restaurants, Sports Bars, Bars, Cajun/Creole, Nightlife'),
 ('Brunchies - Lutz', 280, 'Restaurants, Breakfast & Brunch, Coffee & Tea, Burgers, Food'),
 ('Bangkok Sushi', 275, 'Restaurants, Thai, Sushi Bars')]

In [22]:
#SQL QUERY 4
%%sql
SELECT b.postal_code, COUNT(r.business_id) AS total_reviews
FROM business_df b
JOIN review_df r ON b.business_id = r.business_id
WHERE b.city = 'Lutz'
GROUP BY b.postal_code
ORDER BY total_reviews DESC;

#We will open the fast food restaurant in postal_code 33559

 * mssql+pymssql://xiaoxue-zhang:***@xiaoxueproject.database.windows.net:1433/badm554_project
Done.

[('33559', 8362),
 ('33549', 4882),
 ('33558', 3829),
 ('33548', 2856),
 ('33613', 31),
 ('33604', 16),
 ('33544', 8),
 ('33545', 7)]

In [64]:
#SQL QUERY 5
%%sql
SELECT TOP 10 t.text
FROM tip_df t
JOIN business_df b ON t.business_id = b.business_id
WHERE b.postal_code = '33559' AND b.city = 'Lutz' AND b.stars >= 4
ORDER BY t.date DESC;

#This query helps us identify that most of the good reviews include Pizza so we will add pizza in our menu

 * mssql+pymssql://xiaoxue-zhang:***@xiaoxueproject.database.windows.net:1433/badm554_project
Done.

[('Must try the baklava cheesecake',),
 ('Pizza was really good. Place looked really clean. Very friendly and helpful workers.',),
 ("The boba wasn't that good and it always smells weird in there",),
 ('Excellent compounding pharmacy located in Lutz. The pharmacist is wonderful!!',),
 ('Clean, quick and easy.\nPlus they have a Dog Run/Area!',),
 ("Get the torched salmon roll! It's probably the best sushi roll I've ever eaten.",),
 ('Great services and food. They are really friendly.',),
 ('Great services and food. They are really friendly.',),
 ('Have they closed already?',),
 ('Amazing all around',)]

In [36]:
#SQL QUERY 6
%%sql
SELECT AVG(r.stars) AS avg_city_rating
FROM review_df r
JOIN business_df b ON r.business_id = b.business_id
WHERE b.city = 'Lutz' AND b.postal_code = '33559';

#Our initial target would be to perform better than the area average which is 3.75 stars

 * mssql+pymssql://xiaoxue-zhang:***@xiaoxueproject.database.windows.net:1433/badm554_project
Done.

[(3.749222674001435,)]

In [65]:
#SQL QUERY 7
%%sql
SELECT TOP 10 u.user_id, u.name, COUNT(r.business_id) AS review_count
FROM user_df u
JOIN review_df r ON u.user_id = r.user_id
JOIN business_df b ON r.business_id = b.business_id
WHERE b.city = 'Lutz' AND b.postal_code = '33559'
GROUP BY u.name, u.user_id
ORDER BY review_count DESC;

#this query returns the top reviewers in our restaurant area.
#We will target these customers and offer them promotions so they leave a good review on our business profile

 * mssql+pymssql://xiaoxue-zhang:***@xiaoxueproject.database.windows.net:1433/badm554_project
Done.

[('qjfMBIZpQT9DDtw_BWCopQ', 'Rachel', 46),
 ('Sp2GV7D-_JLZMPQmDanzPQ', 'Brigitte', 34),
 ('fr1Hz2acAb3OaL3l6DyKNg', 'Boon', 31),
 ('xoth_JYqFMIziizRmlRkUQ', 'Mel', 26),
 ('How400tgmS48fbXKdDCO9w', 'Jenna', 25),
 ('hLxIRMn_UtDGVG_8Z9qkEQ', 'Joel', 24),
 ('srOyLIbKTrm5zL8Ad9_cew', 'Carolyn', 23),
 ('u4Dzi_282Zw6hKqZJOhsSw', 'Lisa', 22),
 ('tuoDDqTDCB-lDgelvMrp5Q', 'Lara', 20),
 ('Sii7FesspLggbdLVMuReBA', 'Angel', 20)]

In [49]:
#SQL QUERY 8
%%sql
SELECT TOP 10 t.text, t.compliment_count
FROM tip_df t
JOIN business_df b ON t.business_id = b.business_id
WHERE b.city = 'Lutz' AND b.postal_code = '33559'
ORDER BY t.compliment_count DESC;

#This query gives us tips for the future service of our restaurant i.e. making sure that the pineapple rum sauce is not too sweet

 * mssql+pymssql://xiaoxue-zhang:***@xiaoxueproject.database.windows.net:1433/badm554_project
Done.

[("DON'T EAT HERE!!!! first hand horrible experience! Cockroach in our pizza!! Scroll through the pictures & you'll see everyone else's horrible experience as well. There are 1,000,000 other pizza places in Tampa so choose elsewhere!!", 2),
 ('Man that cheesesteak today hit the spot and brought a smile to my face.', 1),
 ("Google maps only gets you to the vicinity, stay on the road and follow it curving around the plane runway and you'll see a sign for Happy Hangar parking... Then walk toward the buildings next to the parking lot.", 1),
 ('Try the sauce bar, but the pineapple rum sauce is way too sweet( coming from a sweet tooth person)', 1),
 ('11/6 they are doing family movie in the lawn at 7:15pm bring your own chair', 1),
 ('Offer bottled water & a keurig machine with varieties of yummy coffee.', 1),
 ('Get $1 Margaritas all day today for National Margarita day!!', 1),
 ('Great Tea and chill lounge', 1),
 ('July 2021: Now offering gluten-free bread', 1),
 ('Great breakfasts, and fun to watch the planes take off.', 0)]

In [58]:
#SQL QUERY 9
%%sql
SELECT TOP 10 LEN(r.text) AS review_length, COUNT(r.review_id) AS frequency
FROM review_df r
JOIN business_df b ON r.business_id = b.business_id
WHERE b.city = 'Lutz' AND b.postal_code = '33559'
GROUP BY LEN(r.text)
ORDER BY frequency DESC;

#Understanding the distribution of review lengths can provide insights into customer engagement and sentiment in our resturant area.
#Based on the returned info, it is not hard to find out that customers engagement in our resturant area is relatively active.

 * mssql+pymssql://xiaoxue-zhang:***@xiaoxueproject.database.windows.net:1433/badm554_project
Done.

[(136, 31),
 (132, 27),
 (170, 26),
 (124, 25),
 (244, 25),
 (130, 25),
 (148, 24),
 (210, 24),
 (131, 24),
 (134, 24)]

In [66]:
#SQL QUERY 10
%%sql
SELECT TOP 10 u.user_id, COUNT(r.review_id) AS total_reviews,
       COUNT(DISTINCT YEAR(r.date)) AS years_active
FROM user_df u
JOIN review_df r ON u.user_id = r.user_id
JOIN business_df b ON r.business_id = b.business_id
WHERE b.city = 'Lutz' AND b.postal_code = '33559'
GROUP BY u.user_id
HAVING COUNT(DISTINCT YEAR(r.date)) > 1
ORDER BY total_reviews DESC;

#This query identifies loyal customers in our resturant area by analyzing how many reviews they’ve left over multiple years.
#This way we can target the consistent reviewers for a successful business

 * mssql+pymssql://xiaoxue-zhang:***@xiaoxueproject.database.windows.net:1433/badm554_project
Done.

[('qjfMBIZpQT9DDtw_BWCopQ', 46, 11),
 ('Sp2GV7D-_JLZMPQmDanzPQ', 34, 4),
 ('fr1Hz2acAb3OaL3l6DyKNg', 31, 7),
 ('xoth_JYqFMIziizRmlRkUQ', 26, 5),
 ('How400tgmS48fbXKdDCO9w', 25, 6),
 ('hLxIRMn_UtDGVG_8Z9qkEQ', 24, 7),
 ('srOyLIbKTrm5zL8Ad9_cew', 23, 5),
 ('u4Dzi_282Zw6hKqZJOhsSw', 22, 4),
 ('1KVMrASElCoqaPOBqHeY1g', 20, 7),
 ('qxFVQzA67-IxTYRU6P1XCg', 20, 5)]